#+TITLE: gyokaikyor プロジェクトノート
#+PROPERTY: header-args :exports code :results scalar :session *R:gyokaikyor*
#+STARTUP: contents

** 本バッケージ内部で使用するパッケージ
#+BEGIN_SRC R :results silent
  usethis::use_package("magrittr", "Imports")
  usethis::use_package("hash")
  usethis::use_package("tibble")
  usethis::use_package("cellranger")
  usethis::use_package("tidyr")
  usethis::use_package("lubridate")
  usethis::use_package("readxl")
  usethis::use_package("readr")
  usethis::use_package("stringr")
  usethis::use_package("purrr")
  usethis::use_dev_package("tinyplyr")
  usethis::use_package("Nippon")
  usethis::use_package("stringi")
  usethis::use_package("dplyr")
  usethis::use_package("forecast")
  # usethis::use_package("ggplot2", "Imports")
  # usethis::use_package("tibble", "Imports")
  # usethis::use_testthat()
  # usethis::use_pipe()
#+END_SRC

#+BEGIN_SRC sh :exports results :session nil
cat DESCRIPTION
#+END_SRC

#+RESULTS[26e6d91ffe9c3ff5d95f888fb0006e9154a02abb]:
#+begin_example

Package: gyokaikyor
Title: What the Package Does (One Line, Title Case)
Version: 0.0.0.9000
Authors@R: 
    person(given = "First",
           family = "Last",
           role = c("aut", "cre"),
           email = "first.last@example.com")
Description: What the package does (one paragraph).
License: MIT + file LICENSE
Encoding: UTF-8
LazyData: true
Imports: 
    magrittr,
    hash,
    tibble,
    cellranger,
    tinyplyr,
    tidyr,
    lubridate,
    purrr,
    readxl,
    stringr,
    Nippon,
    dplyr
Suggests: 
    testthat,
    covr
RoxygenNote: 6.1.1
#+end_example

#+BEGIN_SRC sh :exports results :session nil
cat NAMESPACE
#+END_SRC

#+RESULTS:
: 
: Generated by roxygen2: do not edit by hand
: <>%")
: >%")

